Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memp.tmx
Source language: ca
Languages: es

source: La resolució de la polisèmia s'ha abordat des de perspectives molt diverses (vegeu {ide98j}); heus-ne ací dues: L'ús de xarxes semàntiques on els conceptes se situen en els nodes (nusos) de la xarxa i s'agrupen jeràrquicament en superconceptes cada vegada més generals (per exemple, els conceptes poma, pera, taronja s'agruparien sota el concepte fruita)., que s'està generalitzant a altres llengües d'Europa ({http://www.dcs.shef.ac.uk/nlp/funded/eurowordnet.html}).} Quan tenim un mot polisèmic, és que li podem associar més d'un concepte.
es: La resolución de la polisemia se ha abordado desde perspectivas muy diversas (véase {ide98j}); aquí tenéis dos: El uso de redes semánticas donde los conceptos se sitúan en los nodos (nudos) de la red y se agrupan jerárquicamente en superconceptos cada vez más generales (por ejemplo, los conceptos poma, pera, taronja se agruparían bajo el concepto fruita)., que se está generalizando a otras lenguas de Europa ({http://www.dcs.shef.ac.uk/nlp/funded/eurowordnet.html}).} Cuando tenemos una palabra polisémica, significa que le podemos asociar más de un concepto.

source: De fet, el model de traducció automàtica mot per mot (definit en la pàg. , i que no s'ha de confondre amb el que els traductors humans anomenen traducció literal) és el model de referència que usarem en aquest capítol: els tres grups de { problemes} que es presenten en aquest capítol són alguns ---no tots--- dels que no resol el model mot per mot: la segmentació del text origen, l'homografia i les divergències sintàctiques.
es: De hecho, el modelo de traducción automática palabra por palabra (definido en la pág. , y que no se tiene que confundir con lo que los traductores humanos denominan traducción literal) es el modelo de referencia que usaremos en este capítulo: los tres grupos de problemas { } que se presentan en este capítulo son algunos ---no todos--- de los que no resuelve el modelo palabra por palabra: la segmentación del texto origen, la homografía y las diferencias sintácticas.

source: Cantamos pot ser present o passat.
es: Cantamos puede ser presente o pasado.

source: El sintagma preposicional ``a Maria'' pot ser l'objecte indirecte de l'oració principal i de la subordinada.
es: El sintagma preposicional ``a Maria'' puede ser el objeto indirecto de la oración principal y de la subordinada.

source: Elegiu dues llengües, $L_1$ i $L_2$ i poseu dos exemples de traduccions errònies de $L_1$ a $L_2$, indicant la frase original, la frase mal traduïda i la frase correcta.
es: Elegid dos lenguas, $ L_1 $ y $ L_2 $ y poned dos ejemplos de traducciones erróneas de $ L_1 $ a $ L_2 $, indicando la frase original, la frase mal traducida y la frase correcta.

source: Tipus d'avaluació
es: Tipo de evaluación

source: De fet, estudiarem tres casos: l'ambigüitat purament deguda a l'ambigüitat dels mots (explícits o nuls); l'ambigüitat purament deguda a l'existència de més d'una estructura sintàctica, l'ambigüitat deguda a les dues causes alhora.
es: De hecho, estudiaremos tres casos: la ambigüedad puramente debida a la ambigüedad de las palabras (explícitas o nulas); la ambigüedad puramente debida a la existencia de más de una estructura sintáctica, la ambigüedad debida a las dos causas a la vez.

source: Un mot (i, en general, una unitat lèxica de més d'un mot) es pot veure des de dues perspectives; d'una banda, la forma superficial del mot és la forma concreta que apareix en el text: cantàvem; d'altra banda, hi ha la forma lèxica, que consisteix en un lema o forma canònica (cantar), una categoria lèxica, classe de mot, o part de l'oració (verb) i uns indicadors de flexió que expressen les característiques morfològiques o flexives (primera persona, nombre plural, temps pretèrit imperfet, mode indicatiu).
es: Una palabra (y, en general, una unidad léxica de más de una palabra) se puede ver desde dos perspectivas; por un lado, la forma superficial de la palabra es la forma concreta que aparece en el texto: cantàvem; por otro lado, está la forma léxica, que consiste en un lema o forma canónica (cantar), una categoría léxica, clase de palabra, o parte de la oración (verbo) y unos indicadores de flexión que expresan las características morfológicas o flexivas (primera persona, número plural, tiempo pretérito imperfecto, modo indicativo).

source: No en totes les llengües és obligatori moure els interrogatius al principi de la frase; per exemple, en xinés, no.
es: No en todas las lenguas es obligatorio mover las partículas interrogativas al principio de la frase; por ejemplo, en chino, no.

source: Indiqueu de quina classe d'ambigüitat es tracta.
es: Indicad de qué clase de ambigüedad se trata.

source: Quina d'aquestes tres tasques és més difícil en un sistema de traducció automàtica espanyol--català?
es: ¿Cuál de estas tres tareas es más difícil en un sistema de traducción automática español--catalán?

source: Noteu que l'el·lipsi dels subjectes no hi està involucrada perquè l'element Qu que es mou no és un sintagma nominal.
es: Notad que la elipsis de los sujetos no está involucrada porque el elemento Qu que se mueve no es un sintagma nominal.

source: La frase ``baixa i puja amb ascensor'' pot voler dir ``(baixa) i (puja amb ascensor)'' o ``(baixa i puja) amb ascensor''.
es: La frase ``baixa i puja amb ascensor'' puede querer decir ``(baja) y (sube con ascensor)'' o ``(baja y sube) con ascensor''.

source: ind., 3a pers.sing.(1a conj.) / subst.masc. i fem.sing.: vale.
es: ind., 3a pers.sing.(1a conj.) / sust.masc. i fem.sing.: vale.

source: El català no té cap construcció equivalent al cuyo espanyol.
es: El catalán no tiene ninguna construcción equivalente al cuyo español.

source: {Resolució de l'ambigüitat lèxica categorial}
es: {Resolución de la ambigüedad léxica categorial}

source: En algunes llengües romàniques (en italià, espanyol i català però no en francés) és comuna l'absència del subjecte quan és de tercera persona.
es: En algunas lenguas románicas (en italiano, español y catalán, pero no en francés) es común la ausencia del sujeto cuando es de tercera persona.

source: Per exemple, l'oració espanyola Aprendió a afeitarse en dos minutos es pot traduir al català Va aprendre a afaitar-se en dos minuts sense resoldre l'ambigüitat següent: és el temps que va tardar a aprendre o el temps que empra per afaitar-se?
es: Por ejemplo, la oración española Aprendió a afeitarse en dos minutos se puede traducir al catalán Va aprendre a afaitar-se en dos minuts sin resolver la ambigüedad siguiente: ¿es el tiempo que tardó en aprender o el tiempo que emplea para afeitarse?

source: Introducció
es: Introducción

source: Homògrafs substantiu--preposició: ante, sobre.
es: Homógrafos sustantivo--preposición: ante, sobre.

source: L'avaluació predictiva pot tenir, a més, un paper fonamental en l'educació dels futurs traductors {mira98j,forcada00p}, en vista de la disponibilitat creixent de sistemes comercials (per exemple, a través d'Internet).
es: La evaluación predictiva puede tener, además, un papel fundamental en la educación de los futuros traductores {mira98j, forcada00p}, en vista de la disponibilidad creciente de sistemas comerciales (por ejemplo, a través de Internet).

source: L'homografia apareix quan un mot (anomenat usualment homògraf) té més d'una anàlisi morfològica possible (vegeu l'apartat ).
es: La homografía aparece cuando una palabra (denominada usualmente homógrafa) tiene más de un análisis morfológico posible (veáse el apartado ).

source: És a dir, en la primera, el pronom interrogatiu qui és el subjecte de l'oració principal; en la segona, és el subjecte de l'oració subordinada, el qual ha experimentat el moviment de Qu (en anglés Wh-movement) obligatori en molts idiomes per als mots amb funció interrogativa.
es: Es decir, en la primera, el pronombre interrogativo qui es el sujeto de la oración principal; en la segunda, es el sujeto de la oración subordinada, el cual ha experimentado el movimiento de Qu (en inglés Wh-movement) obligatorio en muchos idiomas para las palabras con función interrogativa.

source: Problemàtica de la TA espanyol--català
es: Problemática de la TA español - catalán

source: No, perquè cuyo no té un equivalent morfològic en espanyol.
es: No, porque cuyo no tiene un equivalente morfológico en español.

source: En -es: Pres.subj.2a pers.sing.
es: Acabado en -es: Pres.subj.2a pers.sing.

source: Quan es tracta de l'omissió del subjecte, se sol postular en lingüística l'existència d'un pronom especial anomenat PRO, sense forma superficial, que fa de subjecte nul, Joan va veure com PRO queia redolant i al qual s'assigna interpretació mitjançant processos deïctics o anafòrics com els descrits per a altres expressions anafòriques.
es: Cuando se trata de la omisión del sujeto, se suele postular en lingüística la existencia de un pronombre especial llamado PRO, sin forma superficial, que hace de sujeto nulo, Joan va veure com PRO queia redolant y al que se le asigna una interpretación mediante procesos deícticos o anafóricos como los descritos para otras expresiones anafóricas.

source: [(b)] No hi ha cap dona que s'estime els abrics de pell.
es: [(b)] A ninguna mujer le gustan los abrigos de piel.

source: Per exemple, l'oració Les gallines han destrossat el sembrat, però no les mates té dues interpretacions: [(a)] Les gallines han destrossat el sembrat, però (les gallines) no (han destrossat) les mates.
es: Por ejemplo, la oración Les gallines han destrossat el sembrat, però no les mates tiene dos interpretaciones: [(a)] Las gallinas han destrozado el sembrado, pero (las gallinas) no (han destrozado) las matas.

source: Ambigüitat lèxica que necessita una anàlisi semàntica per a resoldre-la: el mot polisèmic destino en l'oració El destino estaba escrito en el billete arrugado que encontraron es traduiria pel català destinació i en canvi en l'oració El destino estaba escrito en el libro sagrado que encontraron es traduiria pel català destí; l'elecció exigeix identificar relacions semàntiques entre les interpretacions dels mots.
es: Ambigüedad léxica que necesita un análisis semántico para resolverla: la palabra polisémica destino en la oración El destino estaba escrito en el billete arrugado que encontraron se traduciría al catalán por destinació y en cambio en la oración El destino estaba escrito en el libro sagrado que encontraron se traduciría al catalán por destí; la elección exige identificar relaciones semánticas entre las interpretaciones de las palabras.

source: `gal·lesos' ) ) ) ) ) {Dos arbres per a la segona part de la comparació ``Els escocesos aprecien més el whisky que els gal·lesos'' (SD =sintagma determinant, D = determinant).}
es: `gal·lesos' ) ) ) ) ) {Dos árboles para la segunda parte de la comparación `Els escocesos aprecien més el whisky que els gal·lesos" (SD =sintagma determinante, D = determinante).}

source: Ambigüitat per el·lipsi: el subjecte de vaja pot ser jo, ell, ella, etc.
es: Ambigüedad por elipsis: el sujeto de vaja puede ser jo, ell, ella, etc.

source: Aquesta oració té, bàsicament, dues interpretacions.
es: Esta oración tiene, básicamente, dos interpretaciones.

source: La traducció (humana) de les frases en la llengua $L_1$ a la llengua $L_2$ ens pot servir per a determinar quina de les anàlisis (interpretacions) de les frases en $L_1$ s'hauria d'elegir i usar aquesta elecció abans de traduir automàticament a $L_3$.
es: La traducción (humana) de las frases en la lengua $L_1$ a la lengua $L_2$ nos puede servir para determinar cuál de los análisis (interpretaciones) de las frases en $L_1$ se tendría que elegir y usar esta elección antes de traducir automáticamente a $L_3$.

source: Aquest tipus d'ambigüitat se sol anomenar ambigüitat estructural d'origen categorial.
es: Este tipo de ambigüedad se suele denominar ambigüedad estructural de origen categorial.

source: De vegades, els mots homògrafs comparteixen una semàntica relacionada, com ahorro, i altres vegades no, com oso.
es: A veces, las palabras homógrafas comparten una semántica relacionada, como ahorro, y otras veces no, como oso.

source: No, perquè les dues formes vendo tenen la mateixa categoria lèxica i la mateixa anàlisi morfològica, tret del lema, i, per tant, poden fer exactament les mateixes funcions sintàctiques.
es: No, porque las dos formas vendo tienen la misma categoría léxica y el mismo análisis morfológico, salvo el lema; por lo tanto, pueden hacer exactamente las mismas funciones sintácticas.

source: Com hem vist, les causes de l'ambigüitat són molt diverses; per això, també són molt diverses les estratègies de resolució.
es: Como hemos visto, las causas de la ambigüedad son muy diversas; por eso, también son muy diversas las estrategias de resolución.

source: O alguna altra persona?
es: ¿O alguna otra persona?

source: Altres: eras.
es: Otros: eras.

source: ``El manifestant es refà de la pallissa que li van donar en l'hospital'' (1: La manifestació va ser una mica violenta i algunes persones han hagut de ser traslladades a l'hospital; 2: Quina pallissa va donar-li l'infermera al quiròfan!).
es: ``El manifestant es refà de la pallissa que li van donar en l'hospital'' (1: La manifestación fue un poco violenta y algunas personas han tenido que ser trasladadas al hospital; 2: ¡Qué paliza le dio la enfermera en el quirófano!).

source: Quan s'avalua un sistema de TA es tenen en compte: La qualitat de les traduccions en brut produïdes pel sistema.
es: Cuando se evalúa un sistema de TA se tienen en cuenta: La calidad de las traducciones en bruto producidas por el sistema.

source: L'ambigüitat es resol normalment usant bé el coneixement lingüístic, bé tècniques estadístiques basades en la freqüència d'aparició en els textos de determinades seqüències curtes (combinacions) de categories lèxiques, o bé les dues aproximacions alhora.
es: La ambigüedad se resuelve normalmente usando bien el conocimiento lingüístico, bien técnicas estadísticas basadas en la frecuencia de aparición en los textos de determinadas secuencias cortas (combinaciones) de categorías léxicas, o bien las dos aproximaciones a la vez.

source: ``Ens va explicar com deien que vindria'' (1: Ens va explicar de quina manera ho deien; 2: Ens va explicar de quina manera vindria segons deien'').
es: ``Ens va explicar com deien que vindria'' (1: Nos explicó de qué manera lo decían; 2: Nos explicó de qué manera vendría a medida que lo decían').

source: El sintagma preposicional per un policia pot modificar el sintagma verbal atrapats a una fàbrica incendiada o només el sintagma verbal incendiada.
es: El sintagma preposicional per un policia puede modificar el sintagma verbal atrapats a una fàbrica incendiada o sólo el sintagma verbal incendiada.

source: persona del plural del present d'indicatiu o del pretèrit indefinit (perfet simple) del verb cantar.
es: persona del plural del presente de indicativo o del pretérito indefinido (perfecto simple) del verbo cantar.

source: ... es deu a l'anàfora.
es: ... se debe a la anáfora.

source: Les úniques combinacions (col·locacions) que apareixen en els textos són atrac odnam i atrac ragul; la segona és la més freqüent i, per tant, l'elegim.
es: Las únicas combinaciones (colocaciones) que aparecen en los textos son atrac odnam y atrac ragul; la segunda es la más frecuente y, por lo tanto, la elegimos.

source: Per exemple, el mot espanyol ahorro pot ser substantiu o verb.
es: Por ejemplo, la palabra ahorro puede ser sustantivo o verbo.

source: Un dels obstacles més importants per a la traducció automàtica (i en general, per a qualsevol programa que haja de processar textos naturals) és l'ambigüitat inherent al llenguatge humà.
es: Uno de los obstáculos más importantes para la traducción automática (y, en general, para cualquier programa que tenga que procesar textos naturales) es la ambigüedad inherente al lenguaje humano.

source: Elegiu una llengua origen i una llengua meta (francés, anglés, alemany, català o espanyol) i poseu un exemple d'oració per a cada un dels tres casos anteriors, on siga necessari un determinat nivell d'anàlisi per tal de resoldre una ambigüitat i produir-ne la traducció correcta.
es: Elegid una lengua origen y una lengua meta (francés, inglés, alemán, catalán o español) y poned un ejemplo de oración para cada uno de los tres casos anteriores, donde sea necesario un determinado nivel de análisis para resolver una ambigüedad y producir la traducción correcta.

source: Aquest tipus d'ambigüitat es pot explicar pel fet que el principi de composicionalitat per si sol no és suficient per a especificar completament l'assignació d'interpretació a una oració; ``hem de reconéixer [l'existència] d'un buit inacceptable entre el que proporciona la sintaxi i el que la semàntica necessita en el cas d'oracions que continguen sintagmes nominals quantificats''} la interpretació de les oracions se sol explicar en termes de { formes lògiques} [p. 357]{radford99b}; en el cas de les oracions amb quantificadors, aquestes formes lògiques contenen d'una banda, variables que poden referir-se a un rang d'objectes que cal considerar i, d'altra, operacions sobre aquestes variables.
es: Este tipo de ambigüedad se puede explicar por el hecho de que el principio de composicionalidad por sí solo no es suficiente para especificar completamente la asignación de interpretación a una oración; ``tenemos que reconocer [la existencia] de un vacío inaceptable entre lo que proporciona la sintaxis y lo que la semántica necesita en el caso de oraciones que contengan sintagmas nominales cuantificados''} la interpretación de las oraciones se suele explicar en términos de { formas lógicas} [p. 357]{radford99b}; en el caso de las oraciones con cuantificadores, estas formas lógicas contienen, por un lado, variables que pueden referirse a un rango de objetos que hay que considerar y, por otro, operaciones sobre estas variables.

source: L'anàfora d'un pronom buit L'anàfora del pronom que.
es: La anáfora de un pronombre vacío La anáfora del pronombre que.

source: Per a inspirar-vos, fixeu-vos en els següents exemples: Va aprendre en dos minuts a afaitar-se Va aprendre a afaitar-se en dos minuts Porta'm les claus de l'armari gran Porta'm de l'armari gran les claus Porta'm les claus de la cadira verda Toni comprarà les taronges que ha de vendre a Reme Toni comprarà a Reme les taronges que ha de vendre
es: Para inspiraros, fijaos en los siguientes ejemplos: Va aprendre en dos minuts a afaitar-se Va aprendre a afaitar-se en dos minuts Porta'm les claus de l'armari gran Porta'm de l'armari gran les claus Porta'm les claus de la cadira verda Toni comprarà les taronges que ha de vendre a Reme Toni comprarà a Reme les taronges que ha de vendre

source: Com es pot decidir si un sistema de TA és millor que un altre?
es: ¿Cómo se puede decidir si un sistema de TA es mejor que otro?

source: L'ambigüitat d'adjunció del sintagma que comença per que.
es: La ambigüedad de adjunción del sintagma que empieza por que.

source: Com es fa l'avaluació?
es: ¿Cómo se hace la evaluación?

source: En aquest cas, la posició on hauria d'anar el subjecte es pot suposar ocupada per un pronom sense forma superficial que dóna lloc a ambigüitat mitjançant mecanismes molt similars als de l'anàfora i per tant, se'ls pot considerar mecanismes lèxics.
es: En este caso, la posición donde tendría que ir el sujeto se puede suponer ocupada por un pronombre sin forma superficial que da lugar a ambigüedad mediante mecanismos muy similares a los de la anáfora y, por lo tanto, se les puede considerar mecanismos léxicos.

source: Considerem l'oració Qui diu que vindrà?
es: Consideremos la oración Qui diu que vindrà?

source: Ambigüitat estructural d'adjunció (angl.{ attachment ambiguity}): es tracta d'un cas típic d'ambigüitat estructural que es manifesta quan hi ha un { adjunt} (típicament un sintagma preposicional) que es pot inserir de diverses maneres en l'arbre d'anàlisi sintàctica de la frase.
es: Ambigüedad estructural de adjunción (ingl.{ attachment ambiguity}): se trata de un caso típico de ambigüedad estructural que se manifiesta cuando hay un { adjunto} (típicamente un sintagma preposicional) que se puede insertar de varias maneras en el árbol de análisis sintáctico de la frase.

source: (cast.) Vale más que las comas (1: ``...que els signes de puntuació''; 2:``...que les menges'') ``El mecánico revisó la suspensión del auto de Garzón'' (1: Aquest mecànic és un expert en legislació i s'ha llegit la resolució judicial sencera; 2: Els amortidors del cotxe de Garzón ja necessitaven una revisió).
es: (cast.) Vale más que las comas (1: " … que los signos de puntuación"; 2: " … que comas las natillas") " El mecánico revisó la suspensión del auto de Garzón" (1: Este mecánico es un experto en legislación y se ha leído la resolución judicial entera; 2: Los amortiguadores del coche de Garzón ya necesitaban una revisión).

source: [Traducció automàtica i traducció humana]{Sobre la comparació entre traducció auto­mà­tica i traducció humana} Una visió predominant de l'avaluació dels sistemes de TA és l'anomenada metàfora del traductor humà, segons la qual {krauwer93j} la tasca consisteix a ``determinar fins a quin punt els constructors del sistema han aconseguit imitar el comportament d'un traductor humà''.
es: [Traducción automática y traducción humana]{Sobre la comparación entre traducción automática y traducción humana} Una visión predominante de la evaluación de los sistemas de TA es la llamada metáfora del traductor humano, según la cual {krauwer93j} la tarea consiste en ``determinar hasta qué punto los constructores del sistema han conseguido imitar el comportamiento de un traductor humano''.

source: persona del singular del present d'indicatiu del verb creer o del verb crear.
es: persona del singular del presente de indicativo del verbo creer o del verbo crear.

source: De l'ambigüitat d'aquestes unitats lèxiques, també se'n sol dir { ambigüitat lèxica pura}.
es: La ambigüedad de estas unidades léxicas también se suele llamar { ambigüedad léxica pura}.

source: A la vista de la notable similitud lingüística existent entre les dues llengües, es podria pensar que la tasca de traducció automàtica podria, en la majoria dels casos, ser tan senzilla com substituir un a un els mots espanyols pels seus equivalents catalans.
es: A la vista de la notable similitud lingüística existente entre las dos lenguas, se podría pensar que la tarea de traducción automática podría, en la mayoría de los casos, ser tan sencilla como sustituir una a una las palabras españolas por sus equivalentes catalanes.

source: D'una banda, lèxica: el mot privado pot ser un adjectiu (interpretació 1) o un participi (interpretació 2).
es: Por un lado, léxica: la palabra privado puede ser un adjetivo (interpretación 1) o un participio (interpretación 2).

source: La comparació dels costos i dels beneficis d'usar un sistema de TA en comptes dels serveis de professionals de la traducció: per exemple, si costa més (en despeses de personal) la postedició (revisió) dels textos meta produïts pel sistema (afegint-hi el cost d'usar el sistema de TA) que la traducció completa dels textos origen per part de professionals, l'adopció del sistema de TA no convé a una empresa (p. ).
es: La comparación de los costes y de los beneficios de usar un sistema de TA en vez de los servicios de profesionales de la traducción: por ejemplo, si cuesta más (en gastos de personal) la postedición (revisión) de los textos meta producidos por el sistema (añadiendo el coste de usar el sistema de TA) que la traducción completa de los textos origen por parte de profesionales, la adopción del sistema de TA no conviene a una empresa (p. ).
